Autodesk.Revit.DB.Visual.Concrete.CommonTintColor
The property labeled "Tint Color" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.CommonTintToggle
The property labeled "Tint" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteBmMap
The property labeled "Image" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteBrightmode
The property labeled "Weathering" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteBrightmodeType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteBumpAmount
The property labeled "Amount" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteBumpMap
The property labeled "Image" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteFinish
The property labeled "Type" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteFinishType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteSealant
The property labeled "Sealant" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteSealantType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete.ConcreteColor
The property labeled "Color" from the "Concrete" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Concrete
Represents the properties of materials.
Since:
2018.1